In [1]:
import pandas as pd

In [2]:
my_list=[5,7,9,-10,11] 
ds=pd.Series(my_list)
ds

0     5
1     7
2     9
3   -10
4    11
dtype: int64

In [3]:
type(ds)

pandas.core.series.Series

In [4]:
ds[2]

9

In [5]:
ds[1:4]

1     7
2     9
3   -10
dtype: int64

In [6]:
type(ds[1:4])

pandas.core.series.Series

In [7]:
type(ds[2])

numpy.int64

In [8]:
my_list = [5, 7, 9, 10, 11, 1.2]
ds=pd.Series(my_list)
ds

0     5.0
1     7.0
2     9.0
3    10.0
4    11.0
5     1.2
dtype: float64

In [9]:
ds[2]

9.0

In [10]:
ds[1:4]

1     7.0
2     9.0
3    10.0
dtype: float64

In [11]:
type(ds[2])

numpy.float64

In [12]:
my_list = [5, 7, 9, 10, 11, 1.2, 'hello'] 
ds = pd.Series(my_list)
ds

0        5
1        7
2        9
3       10
4       11
5      1.2
6    hello
dtype: object

In [13]:
ds[2]

9

In [14]:
ds[5]

1.2

In [15]:
ds[6]

'hello'

In [16]:
type(ds[6])

str

In [17]:
type(ds[5])

float

In [18]:
ds.values

array([5, 7, 9, 10, 11, 1.2, 'hello'], dtype=object)

In [19]:
ds.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
type(ds.values)

numpy.ndarray

In [21]:
my_list = [5, 7, 9, 11]
my_index = ['Joe', 'Kathy', 'Tim', 'Bob'] 
ds = pd.Series(my_list, index=my_index) 
ds

Joe       5
Kathy     7
Tim       9
Bob      11
dtype: int64

In [22]:
ds['Joe']

5

In [23]:
ds['Bob']

11

In [24]:
ds[['Tim', 'Kathy']]

Tim      9
Kathy    7
dtype: int64

In [25]:
ds+5

Joe      10
Kathy    12
Tim      14
Bob      16
dtype: int64

In [26]:
ds*6

Joe      30
Kathy    42
Tim      54
Bob      66
dtype: int64

In [27]:
ds.describe()

count     4.000000
mean      8.000000
std       2.581989
min       5.000000
25%       6.500000
50%       8.000000
75%       9.500000
max      11.000000
dtype: float64

In [28]:
my_bool=ds.isin([5])

In [29]:
my_bool

Joe       True
Kathy    False
Tim      False
Bob      False
dtype: bool

In [30]:
my_bool=ds.isin([5,7])

In [31]:
ds[my_bool]

Joe      5
Kathy    7
dtype: int64

In [32]:
condition1 = ds >7
condition1

Joe      False
Kathy    False
Tim       True
Bob       True
dtype: bool

In [33]:
ds[condition1]

Tim     9
Bob    11
dtype: int64

In [34]:
ds[ds.isin([5,9])]

Joe    5
Tim    9
dtype: int64

In [35]:
ds[ds>7]

Tim     9
Bob    11
dtype: int64

In [36]:
'Tim' in ds

True

In [37]:
my_dict = {'Joe': 4, 'Kathy':5, 'Tim':9, 'Bob': 11}
ds = pd.Series(my_dict)
ds

Joe       4
Kathy     5
Tim       9
Bob      11
dtype: int64

In [38]:
ds1 = pd. Series (['a', 'b', 'c', 'd']) 
ds2 = pd.Series (['e', 'f', 'g']) 
ds = ds1.append(ds2)
ds

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/1056641333.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ds = ds1.append(ds2)

0    a
1    b
2    c
3    d
0    e
1    f
2    g
dtype: object

In [39]:
ds[0]

0    a
0    e
dtype: object

In [40]:
ds[[0,2]]

0    a
0    e
2    c
2    g
dtype: object

In [41]:
ds1+ds2

0     ae
1     bf
2     cg
3    NaN
dtype: object

In [42]:
ds = ds1.append(ds2, ignore_index=True) 
ds

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/4233266643.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ds = ds1.append(ds2, ignore_index=True)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [43]:
county1= {'Alameda': 25000, 
         'SantaClara': 30000, 
         'Solano': 10000, 
         'Marin': 7500}
county2 = {'SantaClara': 20000, 
            'Solano': 20000, 
            'Marin': 5000,
            'Sonoma': 7500}

In [44]:
x= pd.Series(county1)
y= pd.Series(county2)

In [45]:
x+y

Alameda           NaN
Marin         12500.0
SantaClara    50000.0
Solano        30000.0
Sonoma            NaN
dtype: float64

In [46]:
pd.isnull(x+y)

Alameda        True
Marin         False
SantaClara    False
Solano        False
Sonoma         True
dtype: bool

In [47]:
pd.notnull(x+y)

Alameda       False
Marin          True
SantaClara     True
Solano         True
Sonoma        False
dtype: bool

In [48]:
#DataFrames Starts now

In [49]:
my_dict = {
          'name': ['John', 'Bob', 'Kathy'], 
          'age': [25,30,45],
          'gender': ['male', 'female', 'male'], 
          'scores': [23.7, 67.5, 81.0]
  }
df= pd.DataFrame (my_dict)
df

    name  age  gender  scores
0   John   25    male    23.7
1    Bob   30  female    67.5
2  Kathy   45    male    81.0

In [50]:
my_list = [
        {'name': 'John', 'age': 25, 'gender': 'male', 'scores': 23.7}, 
        {'name': 'Bob', 'age': 30, 'gender': 'female', 'scores': 67.5}, 
        {'name': 'Kathy', 'age': 45, 'gender': 'male', 'scores': 81.0},
] 
df = pd.DataFrame (my_list)
df

    name  age  gender  scores
0   John   25    male    23.7
1    Bob   30  female    67.5
2  Kathy   45    male    81.0

In [51]:
x = [['John', 25, 'male', 23.7], 
       ['Bob', 30, 'male', 67.5], 
       ['Kathy', 45, 'female', 81.0]
 ]
df = pd.DataFrame(x, columns=['name', 'age', 'gender', 'scores']) 
df

    name  age  gender  scores
0   John   25    male    23.7
1    Bob   30    male    67.5
2  Kathy   45  female    81.0

In [52]:
df = pd.read_csv('data-Copy1.csv', index_col=False)
df

    id   name  age  gender  chem101
0  111   John   25    male     23.7
1  222    Bob   30    male     67.5
2  333  Kathy   45  female     81.0

In [53]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [54]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [55]:
df.columns

Index(['id', 'name', 'age', 'gender', 'chem101'], dtype='object')

In [56]:
type(df.columns)

pandas.core.indexes.base.Index

In [57]:
df.values

array([[111, 'John', 25, 'male', 23.7],
       [222, 'Bob', 30, 'male', 67.5],
       [333, 'Kathy', 45, 'female', 81.0]], dtype=object)

In [58]:
type(df.values)

numpy.ndarray

In [59]:
df.dtypes

id           int64
name        object
age          int64
gender      object
chem101    float64
dtype: object

In [60]:
import numpy as np

In [61]:
df=df.astype(dtype={ 
         'age': np.int32, 
         'chem101': np.float32, 
         'id': np.int32
}) 
df.dtypes

id           int32
name        object
age          int32
gender      object
chem101    float32
dtype: object

In [62]:
df.ndim

2

In [63]:
df.shape

(3, 5)

In [64]:
df.size

15

In [65]:
df.memory_usage()

Index      128
id          12
name        24
age         12
gender      24
chem101     12
dtype: int64

In [66]:
df=df.astype(dtype={'age': np.int8})
df.memory_usage()

Index      128
id          12
name        24
age          3
gender      24
chem101     12
dtype: int64

In [67]:
df['chem101']

0    23.700001
1    67.500000
2    81.000000
Name: chem101, dtype: float32

In [68]:
df.loc[1]

id          222
name        Bob
age          30
gender     male
chem101    67.5
Name: 1, dtype: object

In [69]:
df.iloc[1]

id          222
name        Bob
age          30
gender     male
chem101    67.5
Name: 1, dtype: object

In [70]:
df2= pd.read_csv('data-Copy1.csv', index_col = 0)
df2

        id  name     age  gender  chem101
111   John    25    male    23.7      NaN
222    Bob    30    male    67.5      NaN
333  Kathy    45  female    81.0      NaN

In [71]:
del df2['chem101']

In [72]:
df2

        id  name     age  gender
111   John    25    male    23.7
222    Bob    30    male    67.5
333  Kathy    45  female    81.0

In [73]:
new_names= {'id':'name',
            'name': 'age',
            'age': 'gender',
            'gender': 'chem101'
}

In [74]:
df2.rename(columns=new_names, inplace=True)
df2

      name  age  gender  chem101
111   John   25    male     23.7
222    Bob   30    male     67.5
333  Kathy   45  female     81.0

In [75]:
df['name']

0     John
1      Bob
2    Kathy
Name: name, dtype: object

In [76]:
type(df['name'])

pandas.core.series.Series

In [77]:
columns_display = ['name', 'chem101']

In [78]:
df[columns_display]

    name    chem101
0   John  23.700001
1    Bob  67.500000
2  Kathy  81.000000

In [79]:
df[['name', 'chem101']]

    name    chem101
0   John  23.700001
1    Bob  67.500000
2  Kathy  81.000000

In [80]:
df['name'].loc[0]

'John'

In [81]:
rows = [0,2]
columns = ['name', 'chem101']

In [82]:
df.loc[rows, columns]

    name    chem101
0   John  23.700001
2  Kathy  81.000000

In [83]:
new_columns = ['age', 'chem101', 'gender', 'name'] 
df3=df[new_columns]
df3

   age    chem101  gender   name
0   25  23.700001    male   John
1   30  67.500000    male    Bob
2   45  81.000000  female  Kathy

In [84]:
df['phys101']= 0
df

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001        0
1  222    Bob   30    male  67.500000        0
2  333  Kathy   45  female  81.000000        0

In [85]:
df.loc[3] = [444, 'James', 22, 'male', 45.7 , 0]

In [86]:
df

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001        0
1  222    Bob   30    male  67.500000        0
2  333  Kathy   45  female  81.000000        0
3  444  James   22    male  45.700000        0

In [87]:
new_row = pd.Series(
                    ['Holly', 555,28,'female', 23.7],
                    index=['name', 'id', 'age', 'gender','chem101']
)

In [88]:
df= df.append(new_row, ignore_index= True)
df

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/442321768.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df= df.append(new_row, ignore_index= True)

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001      0.0
1  222    Bob   30    male  67.500000      0.0
2  333  Kathy   45  female  81.000000      0.0
3  444  James   22    male  45.700000      0.0
4  555  Holly   28  female  23.700000      NaN

In [89]:
import numpy as np
df['phys101'] = [82.1, 59.2, 70.1, 32.9,  np.nan]

In [90]:
df

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001     82.1
1  222    Bob   30    male  67.500000     59.2
2  333  Kathy   45  female  81.000000     70.1
3  444  James   22    male  45.700000     32.9
4  555  Holly   28  female  23.700000      NaN

In [91]:
new_list = [
             {'id': 666, 'name': 'Tim','age':26, 'gender': 'male', 'chem101':33.7}, 
             {'id': 777, 'name': 'Mike', 'age':30, 'gender': 'male', 'phys101':87.5}, 
             {'id': 888, 'name': 'Marla', 'age':45, 'gender': 'female', 'phys101':91.0}
]

In [92]:
df2 = pd.DataFrame(new_list)
df2

    id   name  age  gender  chem101  phys101
0  666    Tim   26    male     33.7      NaN
1  777   Mike   30    male      NaN     87.5
2  888  Marla   45  female      NaN     91.0

In [93]:
df.append(df2)

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001     82.1
1  222    Bob   30    male  67.500000     59.2
2  333  Kathy   45  female  81.000000     70.1
3  444  James   22    male  45.700000     32.9
4  555  Holly   28  female  23.700000      NaN
0  666    Tim   26    male  33.700000      NaN
1  777   Mike   30    male        NaN     87.5
2  888  Marla   45  female        NaN     91.0

In [94]:
df.append(df2, ignore_index=True)

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

    id   name  age  gender    chem101  phys101
0  111   John   25    male  23.700001     82.1
1  222    Bob   30    male  67.500000     59.2
2  333  Kathy   45  female  81.000000     70.1
3  444  James   22    male  45.700000     32.9
4  555  Holly   28  female  23.700000      NaN
5  666    Tim   26    male  33.700000      NaN
6  777   Mike   30    male        NaN     87.5
7  888  Marla   45  female        NaN     91.0

In [95]:
df= pd.read_csv('students.csv')

In [96]:
df

    id   name  age  gender  chem101  phys101  math101
0  111   John   25    male     23.7     34.2     64.1
1  222    Bob   30    male     67.5     76.2     89.1
2  333  Kathy   45  female     81.0     91.8     98.8
3  444  James   22    male     45.7     32.9     12.3
4  555  Holly   28  female     23.7      NaN     34.9
5  666    Tim   26    male     33.7     78.1      NaN
6  777   Mike   30    male      NaN     87.5     98.1
7  888  Marla   45  female     67.1     56.9      NaN

In [97]:
df.mean()

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

id         499.500000
age         31.375000
chem101     48.914286
phys101     65.371429
math101     66.216667
dtype: float64

In [98]:
df.describe()

               id        age    chem101    phys101    math101
count    8.000000   8.000000   7.000000   7.000000   6.000000
mean   499.500000  31.375000  48.914286  65.371429  66.216667
std    271.893361   8.814558  23.162357  24.376335  36.039113
min    111.000000  22.000000  23.700000  32.900000  12.300000
25%    305.250000  25.750000  28.700000  45.550000  42.200000
50%    499.500000  29.000000  45.700000  76.200000  76.600000
75%    693.750000  33.750000  67.300000  82.800000  95.850000
max    888.000000  45.000000  81.000000  91.800000  98.800000

In [99]:
df.mean(axis=1)

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/3676274908.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

0     51.60
1     96.96
2    129.92
3    111.38
4    160.40
5    200.95
6    248.15
7    264.25
dtype: float64

In [100]:
scores = df[['chem101', 'phys101', 'math101']]
scores

   chem101  phys101  math101
0     23.7     34.2     64.1
1     67.5     76.2     89.1
2     81.0     91.8     98.8
3     45.7     32.9     12.3
4     23.7      NaN     34.9
5     33.7     78.1      NaN
6      NaN     87.5     98.1
7     67.1     56.9      NaN

In [101]:
av_score = scores.mean(axis=1)

In [102]:
av_score

0    40.666667
1    77.600000
2    90.533333
3    30.300000
4    29.300000
5    55.900000
6    92.800000
7    62.000000
dtype: float64

In [103]:
df['average']= av_score

In [104]:
df

    id   name  age  gender  chem101  phys101  math101    average
0  111   John   25    male     23.7     34.2     64.1  40.666667
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
3  444  James   22    male     45.7     32.9     12.3  30.300000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
7  888  Marla   45  female     67.1     56.9      NaN  62.000000

In [105]:
df['average'] = df[['chem101', 'phys101', 'math101']].mean(axis=1)

In [106]:
df

    id   name  age  gender  chem101  phys101  math101    average
0  111   John   25    male     23.7     34.2     64.1  40.666667
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
3  444  James   22    male     45.7     32.9     12.3  30.300000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
7  888  Marla   45  female     67.1     56.9      NaN  62.000000

In [107]:
df.sort_values(by='age')

    id   name  age  gender  chem101  phys101  math101    average
3  444  James   22    male     45.7     32.9     12.3  30.300000
0  111   John   25    male     23.7     34.2     64.1  40.666667
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
7  888  Marla   45  female     67.1     56.9      NaN  62.000000

In [108]:
df.sort_values(by='age', ascending=False)

    id   name  age  gender  chem101  phys101  math101    average
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
7  888  Marla   45  female     67.1     56.9      NaN  62.000000
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
0  111   John   25    male     23.7     34.2     64.1  40.666667
3  444  James   22    male     45.7     32.9     12.3  30.300000

In [109]:
df.sort_values(by=['age', 'id'], ascending=[False, False])

    id   name  age  gender  chem101  phys101  math101    average
7  888  Marla   45  female     67.1     56.9      NaN  62.000000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
0  111   John   25    male     23.7     34.2     64.1  40.666667
3  444  James   22    male     45.7     32.9     12.3  30.300000

In [110]:
df['average']>50

0    False
1     True
2     True
3    False
4    False
5     True
6     True
7     True
Name: average, dtype: bool

In [111]:
condition = df['average']<50
df[condition]

    id   name  age  gender  chem101  phys101  math101    average
0  111   John   25    male     23.7     34.2     64.1  40.666667
3  444  James   22    male     45.7     32.9     12.3  30.300000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000

In [112]:
df[condition][['name', 'id']]

    name   id
0   John  111
3  James  444
4  Holly  555

# Filling Out the missing Data

In [113]:
df

    id   name  age  gender  chem101  phys101  math101    average
0  111   John   25    male     23.7     34.2     64.1  40.666667
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
3  444  James   22    male     45.7     32.9     12.3  30.300000
4  555  Holly   28  female     23.7      NaN     34.9  29.300000
5  666    Tim   26    male     33.7     78.1      NaN  55.900000
6  777   Mike   30    male      NaN     87.5     98.1  92.800000
7  888  Marla   45  female     67.1     56.9      NaN  62.000000

In [114]:
df.mean(skipna=False)

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/2167959751.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean(skipna=False)

id         499.5000
age         31.3750
chem101         NaN
phys101         NaN
math101         NaN
average     59.8875
dtype: float64

In [115]:
df['chem101'].mean(skipna=False)

nan

In [116]:
df['chem101'].mean()

48.91428571428571

In [117]:
df.dropna()

    id   name  age  gender  chem101  phys101  math101    average
0  111   John   25    male     23.7     34.2     64.1  40.666667
1  222    Bob   30    male     67.5     76.2     89.1  77.600000
2  333  Kathy   45  female     81.0     91.8     98.8  90.533333
3  444  James   22    male     45.7     32.9     12.3  30.300000

In [118]:
df= pd.read_csv('students.csv', index_col=False)

In [119]:
df

    id   name  age  gender  chem101  phys101  math101
0  111   John   25    male     23.7     34.2     64.1
1  222    Bob   30    male     67.5     76.2     89.1
2  333  Kathy   45  female     81.0     91.8     98.8
3  444  James   22    male     45.7     32.9     12.3
4  555  Holly   28  female     23.7      NaN     34.9
5  666    Tim   26    male     33.7     78.1      NaN
6  777   Mike   30    male      NaN     87.5     98.1
7  888  Marla   45  female     67.1     56.9      NaN

In [120]:
for row_name, row in df.iterrows():
    print(row_name, '\n', row)

0
 id          111
name       John
age          25
gender     male
chem101    23.7
phys101    34.2
math101    64.1
Name: 0, dtype: object
1
 id          222
name        Bob
age          30
gender     male
chem101    67.5
phys101    76.2
math101    89.1
Name: 1, dtype: object
2
 id            333
name        Kathy
age            45
gender     female
chem101      81.0
phys101      91.8
math101      98.8
Name: 2, dtype: object
3
 id           444
name       James
age           22
gender      male
chem101     45.7
phys101     32.9
math101     12.3
Name: 3, dtype: object
4
 id            555
name        Holly
age            28
gender     female
chem101      23.7
phys101       NaN
math101      34.9
Name: 4, dtype: object
5
 id          666
name        Tim
age          26
gender     male
chem101    33.7
phys101    78.1
math101     NaN
Name: 5, dtype: object
6
 id          777
name       Mike
age          30
gender     male
chem101     NaN
phys101    87.5
math101    98.1
Name: 6, dtype: object
7
 id            888
name        Marla
age            45
gender     female
chem101      67.1
phys101      56.9
math101       NaN
Name: 7, dtype: object

In [121]:
for row_name, row in df.iterrows():
    print(row_name, '\n', type(row))

0
 <class 'pandas.core.series.Series'>
1
 <class 'pandas.core.series.Series'>
2
 <class 'pandas.core.series.Series'>
3
 <class 'pandas.core.series.Series'>
4
 <class 'pandas.core.series.Series'>
5
 <class 'pandas.core.series.Series'>
6
 <class 'pandas.core.series.Series'>
7
 <class 'pandas.core.series.Series'>

In [122]:
for row in df.itertuples():
    print(row.Index, row.name, row.chem101)

0 John 23.7
1 Bob 67.5
2 Kathy 81.0
3 James 45.7
4 Holly 23.7
5 Tim 33.7
6 Mike nan
7 Marla 67.1

In [123]:
df.groupby('gender')

In [124]:
df.groupby('gender').groups

{'female': [2, 4, 7], 'male': [0, 1, 3, 5, 6]}

In [125]:
df.groupby('gender').size()

gender
female    3
male      5
dtype: int64

In [126]:
df.groupby('gender').mean()

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/1544238222.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('gender').mean()

           id        age    chem101  phys101  math101
gender
female  592.0  39.333333  57.266667    74.35    66.85
male    444.0  26.600000  42.650000    61.78    65.90

In [127]:
df.groupby('gender')[['chem101','phys101']].mean()

          chem101  phys101
gender
female  57.266667    74.35
male    42.650000    61.78

In [128]:
df.groupby('gender').min()

         id   name  age  chem101  phys101  math101
gender
female  333  Holly   28     23.7     56.9     34.9
male    111    Bob   22     23.7     32.9     12.3

In [129]:
df.groupby('gender').max()

         id   name  age  chem101  phys101  math101
gender
female  888  Marla   45     81.0     91.8     98.8
male    777    Tim   30     67.5     87.5     98.1

In [130]:
df= pd.read_csv('covid.csv')

In [131]:
df

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,67743,68366,69130,70111,70761,71838,72977,74026,75119,76628
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,132244,132264,132285,132297,132309,132315,132337,132351,132360,132372
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,127646,127926,128198,128456,128725,128913,129218,129640,129976,130361
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,13671,13682,13693,13693,13693,13727,13729,13744,13752,13758
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,33338,33607,33944,34180,34366,34551,34752,34960,35140,35307
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,6086,6356,6396,6908,7107,7432,7625,7870,8063,8364
272,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,306795,306795,307569,307838,308048,308350,308732,309036,309333,309644
273,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,6688,6696,6723,6731,6737,6742,6751,6759,6767,6773
274,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,93627,93947,94430,94751,95050,95263,95821,96563,97388,98376
275,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,38819,38854,38918,38933,38944,38961,38998,39031,39092,39144

In [132]:
df.memory_usage()

Index              128
Province/State    2208
Country/Region    2208
Lat               2208
Long              2208
                  ...
5/31/21           2208
6/1/21            2208
6/2/21            2208
6/3/21            2208
6/4/21            2208
Length: 505, dtype: int64

In [133]:
df.memory_usage().sum()

1112960

In [134]:
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,67743,68366,69130,70111,70761,71838,72977,74026,75119,76628
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,132244,132264,132285,132297,132309,132315,132337,132351,132360,132372
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,127646,127926,128198,128456,128725,128913,129218,129640,129976,130361
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,13671,13682,13693,13693,13693,13727,13729,13744,13752,13758
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,33338,33607,33944,34180,34366,34551,34752,34960,35140,35307

In [135]:
df.drop(['Lat','Long'], axis=1, inplace = True)
df.head()

,Province/State,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
0,NaN,Afghanistan,0,0,0,0,0,0,0,0,...,67743,68366,69130,70111,70761,71838,72977,74026,75119,76628
1,NaN,Albania,0,0,0,0,0,0,0,0,...,132244,132264,132285,132297,132309,132315,132337,132351,132360,132372
2,NaN,Algeria,0,0,0,0,0,0,0,0,...,127646,127926,128198,128456,128725,128913,129218,129640,129976,130361
3,NaN,Andorra,0,0,0,0,0,0,0,0,...,13671,13682,13693,13693,13693,13727,13729,13744,13752,13758
4,NaN,Angola,0,0,0,0,0,0,0,0,...,33338,33607,33944,34180,34366,34551,34752,34960,35140,35307

In [136]:
df_orignal = df.copy(deep= True)

In [137]:
df['Province/State'].notnull()

0      False
1      False
2      False
3      False
4      False
       ...
271    False
272    False
273    False
274    False
275    False
Name: Province/State, Length: 276, dtype: bool

In [138]:
df[df['Province/State'].notnull()]

,Province/State,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
8,Australian Capital Territory,Australia,0,0,0,0,0,0,0,0,...,124,124,124,124,124,124,124,124,124,124
9,New South Wales,Australia,0,0,0,0,3,4,4,4,...,5576,5579,5580,5585,5587,5587,5588,5590,5590,5590
10,Northern Territory,Australia,0,0,0,0,0,0,0,0,...,172,172,173,173,173,173,173,173,173,173
11,Queensland,Australia,0,0,0,0,0,0,0,1,...,1613,1615,1616,1618,1618,1618,1619,1621,1621,1630
12,South Australia,Australia,0,0,0,0,0,0,0,0,...,752,752,752,752,754,754,754,760,760,761
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Gibraltar,United Kingdom,0,0,0,0,0,0,0,0,...,4290,4292,4293,4293,4293,4295,4296,4298,4299,4300
262,Isle of Man,United Kingdom,0,0,0,0,0,0,0,0,...,1591,1591,1592,1592,1592,1592,1594,1594,1595,1597
263,Montserrat,United Kingdom,0,0,0,0,0,0,0,0,...,20,20,20,20,20,20,20,20,20,20
264,"Saint Helena, Ascension and Tristan da Cunha",United Kingdom,0,0,0,0,0,0,0,0,...,4,4,4,4,4,4,4,4,4,4
265,Turks and Caicos Islands,United Kingdom,0,0,0,0,0,0,0,0,...,2409,2411,2411,2412,2415,2417,2417,2418,2418,2419

In [139]:
df = df.groupby('Country/Region').sum()

/var/folders/c6/0q4dv4cn42g5_ddh8w5xsb3r0000gn/T/ipykernel_2950/1999653484.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df = df.groupby('Country/Region').sum()

In [140]:
df.head()

,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,1/31/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
Country/Region,,,,,,,,,,,,,,,,,,,,,
Afghanistan,0,0,0,0,0,0,0,0,0,0,...,67743,68366,69130,70111,70761,71838,72977,74026,75119,76628
Albania,0,0,0,0,0,0,0,0,0,0,...,132244,132264,132285,132297,132309,132315,132337,132351,132360,132372
Algeria,0,0,0,0,0,0,0,0,0,0,...,127646,127926,128198,128456,128725,128913,129218,129640,129976,130361
Andorra,0,0,0,0,0,0,0,0,0,0,...,13671,13682,13693,13693,13693,13727,13729,13744,13752,13758
Angola,0,0,0,0,0,0,0,0,0,0,...,33338,33607,33944,34180,34366,34551,34752,34960,35140,35307

In [141]:
df.loc['Australia']

1/22/20        0
1/23/20        0
1/24/20        0
1/25/20        0
1/26/20        4
           ...
5/31/21    30118
6/1/21     30124
6/2/21     30137
6/3/21     30141
6/4/21     30157
Name: Australia, Length: 500, dtype: int64

In [142]:
df_orignal[df_orignal['Country/Region']=='Australia']

,Province/State,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,...,5/26/21,5/27/21,5/28/21,5/29/21,5/30/21,5/31/21,6/1/21,6/2/21,6/3/21,6/4/21
8,Australian Capital Territory,Australia,0,0,0,0,0,0,0,0,...,124,124,124,124,124,124,124,124,124,124
9,New South Wales,Australia,0,0,0,0,3,4,4,4,...,5576,5579,5580,5585,5587,5587,5588,5590,5590,5590
10,Northern Territory,Australia,0,0,0,0,0,0,0,0,...,172,172,173,173,173,173,173,173,173,173
11,Queensland,Australia,0,0,0,0,0,0,0,1,...,1613,1615,1616,1618,1618,1618,1619,1621,1621,1630
12,South Australia,Australia,0,0,0,0,0,0,0,0,...,752,752,752,752,754,754,754,760,760,761
13,Tasmania,Australia,0,0,0,0,0,0,0,0,...,234,234,234,234,234,234,234,234,234,234
14,Victoria,Australia,0,0,0,0,1,1,1,1,...,20575,20581,20587,20593,20598,20609,20614,20617,20621,20627
15,Western Australia,Australia,0,0,0,0,0,0,0,0,...,1017,1017,1017,1017,1017,1019,1018,1018,1018,1018

In [143]:
df_orignal[df_orignal['Country/Region']=='Australia'].sum()

Province/State    Australian Capital TerritoryNew South WalesNor...
Country/Region    AustraliaAustraliaAustraliaAustraliaAustraliaA...
1/22/20                                                           0
1/23/20                                                           0
1/24/20                                                           0
                                        ...
5/31/21                                                       30118
6/1/21                                                        30124
6/2/21                                                        30137
6/3/21                                                        30141
6/4/21                                                        30157
Length: 502, dtype: object

In [144]:
df=df.T

In [145]:
df

Country/Region,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua and Barbuda,Argentina,Armenia,Australia,Austria,...,United Kingdom,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,West Bank and Gaza,Yemen,Zambia,Zimbabwe
1/22/20,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1/23/20,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,2,0,0,0,0
1/24/20,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,2,0,0,0,0
1/25/20,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,2,0,0,0,0
1/26/20,0,0,0,0,0,0,0,0,4,0,...,0,0,0,0,0,2,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5/31/21,71838,132315,128913,13727,34551,1260,3781784,222670,30118,644815,...,4503231,294503,100335,4,234165,7432,308350,6742,95263,38961
6/1/21,72977,132337,129218,13729,34752,1260,3817139,222778,30124,645152,...,4506333,298006,100495,4,235567,7625,308732,6751,95821,38998
6/2/21,74026,132351,129640,13744,34960,1262,3852156,222870,30137,645552,...,4510597,301524,100726,4,236755,7870,309036,6759,96563,39031
6/3/21,75119,132360,129976,13752,35140,1262,3884447,222978,30141,645834,...,4515778,304411,100997,4,238013,8063,309333,6767,97388,39092
6/4/21,76628,132372,130361,13758,35307,1263,3915397,223050,30157,646167,...,4521922,308490,101198,4,239252,8364,309644,6773,98376,39144

In [146]:
df.dtypes

Country/Region
Afghanistan           int64
Albania               int64
Algeria               int64
Andorra               int64
Angola                int64
                      ...
Vietnam               int64
West Bank and Gaza    int64
Yemen                 int64
Zambia                int64
Zimbabwe              int64
Length: 193, dtype: object

In [147]:
df.columns

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'United Kingdom', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'West Bank and Gaza', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='Country/Region', length=193)

In [148]:
df= df[df.columns].astype(np.uint32)
df.dtypes

Country/Region
Afghanistan           uint32
Albania               uint32
Algeria               uint32
Andorra               uint32
Angola                uint32
                       ...
Vietnam               uint32
West Bank and Gaza    uint32
Yemen                 uint32
Zambia                uint32
Zimbabwe              uint32
Length: 193, dtype: object

In [149]:
df.index

Index(['1/22/20', '1/23/20', '1/24/20', '1/25/20', '1/26/20', '1/27/20',
       '1/28/20', '1/29/20', '1/30/20', '1/31/20',
       ...
       '5/26/21', '5/27/21', '5/28/21', '5/29/21', '5/30/21', '5/31/21',
       '6/1/21', '6/2/21', '6/3/21', '6/4/21'],
      dtype='object', length=500)

In [150]:
dt_index = pd.to_datetime(df.index)

In [151]:
type(dt_index)

pandas.core.indexes.datetimes.DatetimeIndex

In [152]:
dt_index[0]

Timestamp('2020-01-22 00:00:00')

In [153]:
type(dt_index[0])

pandas._libs.tslibs.timestamps.Timestamp

In [155]:
df= df.set_index(dt_index)
df.index

DatetimeIndex(['2020-01-22', '2020-01-23', '2020-01-24', '2020-01-25',
               '2020-01-26', '2020-01-27', '2020-01-28', '2020-01-29',
               '2020-01-30', '2020-01-31',
               ...
               '2021-05-26', '2021-05-27', '2021-05-28', '2021-05-29',
               '2021-05-30', '2021-05-31', '2021-06-01', '2021-06-02',
               '2021-06-03', '2021-06-04'],
              dtype='datetime64[ns]', length=500, freq=None)